In [2]:
import pandas as pd
import numpy as np

In [18]:
a = np.array([[1,2,3],[4,5,6]]) 
row, col = a.shape
a.shape =(row*col,1)
a

array([[1],
       [2],
       [3],
       [4],
       [5],
       [6]])

In [2]:
df = pd.DataFrame(np.random.randn(5, 3), index=['a', 'c', 'e', 'f','h'],columns=['one', 'two', 'three'])
df

        one       two     three
a -0.105371  2.230970  0.417474
c  0.882863  0.449693  0.999647
e  0.138555 -0.707139  0.856391
f  0.939449 -0.621023  2.013436
h -0.000485 -0.467183 -1.715754

In [19]:
df = df.reindex(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'])
df

        one       two     three  new
a -0.105371  2.230970  0.417474  123
b       NaN       NaN       NaN  123
c  0.882863  0.449693  0.999647  123
d       NaN       NaN       NaN  123
e  0.138555 -0.707139  0.856391  123
f  0.939449 -0.621023  2.013436  123
g       NaN       NaN       NaN  123
h -0.000485 -0.467183 -1.715754  123

In [20]:
df['one'].isnull()

a    False
b     True
c    False
d     True
e    False
f    False
g     True
h    False
Name: one, dtype: bool

In [21]:
df['new'] = df.one.isnull()

In [22]:
df

        one       two     three    new
a -0.105371  2.230970  0.417474  False
b       NaN       NaN       NaN   True
c  0.882863  0.449693  0.999647  False
d       NaN       NaN       NaN   True
e  0.138555 -0.707139  0.856391  False
f  0.939449 -0.621023  2.013436  False
g       NaN       NaN       NaN   True
h -0.000485 -0.467183 -1.715754  False

In [15]:
df[df.one.notnull()]

        one       two     three
a -0.105371  2.230970  0.417474
c  0.882863  0.449693  0.999647
e  0.138555 -0.707139  0.856391
f  0.939449 -0.621023  2.013436
h -0.000485 -0.467183 -1.715754

In [14]:
df[np.logical_and(df.one.notnull(), df.two <=0)]

        one       two     three
e  0.138555 -0.707139  0.856391
f  0.939449 -0.621023  2.013436
h -0.000485 -0.467183 -1.715754

In [52]:
import pandas as pd
import numpy as np
df = pd.DataFrame({'Column one':[10,20,30,40,50,2000],'Column two':[1000,0,30,40,50,60]})
df

   Column one  Column two
0          10        1000
1          20           0
2          30          30
3          40          40
4          50          50
5        2000          60

In [59]:
df.columns = df.columns.str.replace(" ", "_")
df.columns = df.columns.str.lower()
df.column_one
#df.columns = series(map(lambda x: str.lower, df.columns))

0      10
1      20
2      30
3      40
4      50
5    2000
Name: column_one, dtype: int64

In [57]:
df.column_two.replace({1000:10,2000:60}, inplace = True)
df

   column_one  column_two
0          10          10
1          20           0
2          30          30
3          40          40
4          50          50
5        2000          60

In [69]:
test1 = [True, True, False, False]
test2 = [True, False, True, False]


print ('logical_and: {}'.format(np.logical_and(test1,test2)))
print ('logical_or: {}'.format(np.logical_or(test1,test2)))
print ('logical_xor: {}'.format(np.logical_xor(test1,test2)))

logical_and: [ True False False False]
logical_or: [ True  True  True False]
logical_xor: [False  True  True False]